latina = {
    'а': 'a',
    'ә': 'а',
    'б': 'b',
    'в': 'v',
    'г': 'g',
    'ғ': 'ǵ',
    'д': 'd',
    'е': 'e',
    'ё': 'e',
    'ж': 'j',
    'з': 'z',
    'и': 'ı',
    'й': 'ı', 
    'к': 'k',
    'қ': 'q',
    'л': 'l',
    'м': 'm',
    'н': 'n',
    'ң': 'n',
    'о': 'o',
    'ө': 'o',
    'п': 'p',
    'р': 'r',
    'с': 's',
    'т': 't',
    'у': 'y',
    'ұ': 'u',
    'ү': 'ú',
    'ф': 'f',
    'х': 'h',
    'һ': 'h',
    'ц': 'c',
    'ч': 'ch',
    'ш': 'sh',
    'щ': 'sh',
    'ы': 'y',
    'і': 'i',
    'э': 'e',
    'ю': 'ıy', 
    'я': 'ıa'
    }
    
kaz_text = input("Введите текст: ")
latin_text = ''
for i in kaz_text: 
    if i.lower() in latina:
        latin_text += latina[i.lower()]
print("Латинский текст: ",latin_text)